Revit 2027 API
SymbolTypeId.DegreeF Property
 Symbol °F, indicating unit Fahrenheit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DegreeF { get; }
Public Shared ReadOnly Property DegreeF As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DegreeF {
	ForgeTypeId^ get ();
}
static member DegreeF : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace